# Importing Libraries

In [11]:
# Importing Libraries
import pandas as pd
import numpy as np
import os

In [12]:
path = r'C:\Users\Akira\Documents\Instacart Basket Analysis'

In [13]:
df_ords = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'orders.csv'), index_col = False)

In [14]:
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'), index_col = False)

## Mixed Data Types

In [15]:
# create a fake dataframe

df_test = pd.DataFrame()

In [16]:
# create a mixed column

df_test['mix'] = ['a', 'b', 1, True]

In [17]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [18]:
# Check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

Without going into too much detail, let’s take a look at what’s happening here. Remember that you don’t need to understand everything just yet! Use this opportunity to slowly become more familiar with the ways things are written and conducted in Python.

The structure that’s being used in this code is called a “for-loop.” The “for” in for-loop stands for “for these elements, do this,” and the “loop” describes how the structure works: looping over and over again as it performs the procedures detailed by the “for.” Here, the for-loop is looping through each column in the dataframe and executing the same block of code each time.

Within the for-loop, a new variable is created: weird. Assigned to it is a test that checks whether the data types within the column are consistent. The weird variable will ultimately take a boolean value of either True or False. If True, that means the column contains inconsistent data types. If False, that means the column contains only one data type. Boolean values can also be represented by numbers: 0 as False and 1 as True.

Here comes the “if” statement. An if statement checks if some condition is met, and if it’s met, executes a line of code. If the condition isn’t met, the code isn’t executed. Here, the if statement is checking whether weird is true or false. If it’s greater than 0, than it’s true. If not, it’s false. If weird is true, the command print(col) is executed, which prints the problematic column for you to see. Because of the for-loop, this command will be executed on every column in your dataframe, printing every mixed-type column it finds. Pretty slick!

Now that you know how to find mixed-type columns within your dataframe, you need to know how to fix them. The first step is deciding what single data type the column in question should be. If your column contained mostly names, for instance, it should be a string. If it contained mostly order numbers, it should be a numeric value of some sort. You can only make a knowledged decision about what data type the column should be after having explored and analyzed the data in your dataframe. Once you’ve reached a decision, you can run the following code you first learned in the previous Exercise:

In [19]:
# Change the column to a certain data type

df_test['mix'] = df_test['mix'].astype('str')

# Missing Values

In [20]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

The isnull is used to find missing functions, and then using the sum function to group each column

 Next Create a subset of only the values where product name is missing.

In [21]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [22]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

There are a few ways to deal with missing data:

1)Create a new variable that acts like a flag based on the missing value.

create a new column containing the string values  status of each profile.

2)Impute the value with the mean or median of the column (if the variable is numeric).

If you choose to use the mean, you can use the df.describe() function to find the mean of the column in question, then use the following code to replace your missing values with it:

df['column with missings'].fillna(mean value, inplace=True)
If you choose to use the median, you can find it using the df_prods.median() function, then use the same command as above, only replacing “mean value” with “median value”:

df['column with missings'].fillna(median value, inplace=True)

3)Remove or filter out the missing data.

In [23]:
#check the current number of rows to compare to the subset to remove
df_prods.shape

(49693, 5)

In [24]:
# Create a new subset, removing the missing values

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [25]:
df_prods_clean.shape

(49677, 5)

The exact number of rows from df_nan are removed from df_prods in this new set

Removing the missing values from df_prods itself 

example 1. df_prods.dropna(inplace = True)

example 2(only drop missing values from column) - df_prods.dropna(subset = [‘product_name’], inplace = True)

# Duplicates

In [26]:
# Looking for duplicates

df_dups = df_prods_clean[df_prods_clean.duplicated()]

This code creates a new subset of df_prods_clean—df_dups—containing only rows that are duplicates. The duplicated() function is what identifies duplicate rows. It’s run on the df_prods_clean dataframe. Any duplicate rows that it finds are saved within the new df_dups dataframe.

In [27]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

pandas function to remove duplicates - df.drop_duplicates()

In [28]:
df_prods_clean.shape

(49677, 5)

In [29]:
# new dataframe that removes duplicates

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [30]:
df_prods_clean_no_dups.shape

(49672, 5)

In [31]:
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'products_checked.csv'))

# 4.5 assignment

In [32]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Based on this data profile, I would potentially look at the days_since_prior order. My belief is that since the minimum is 0, that could entail something to look into because it would be odd for someone to be ordering two instacart orders in one day.

## checking for mixed data columns

In [46]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

## Missing Values

In [34]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In this report the only column that are missing values is the days_since_prior_order column. This could be because of an instacart data entry error of accessing a customer's prior order. Or this is the instance of customers only purchasing one instacart order, so it records one order as missing. This is a significant amount of lost data, 16.59%

In [35]:
df_ords.shape

(3421083, 7)

In [36]:
3421083 / 206209

16.590367054784224

In [37]:
mean_value = df_ords['days_since_prior_order'].mean()

In [38]:
df_ords['days_since_prior_order'].fillna(mean_value, inplace=True)

My reasoning of replacing the missing values with the mean is because the mean value is an average amount and the column itself does not contain any major outliers.

In [39]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,11.114836
1,2398795,1,prior,2,3,7,15.000000
2,473747,1,prior,3,3,12,21.000000
3,2254736,1,prior,4,4,7,29.000000
4,431534,1,prior,5,4,15,28.000000

## checking for duplicates

In [40]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [41]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

This analysis shows that there are no duplicate values among all of the columns

Because no duplicate values were found, I do not have to remove anything from df_ords

In [42]:
df_ords.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_checked.csv'))